[
  {
    "Title": "Iron Man",
    "Year": "2008",
    "Runtime": "126 min",
    "Genre": "Action, Adventure, Sci-Fi",
    "Plot": "Tony Stark. Genius, billionaire, playboy, philanthropist. Son of legendary inventor and weapons contractor Howard Stark. When Tony Stark is assigned to give a weapons presentation to an Iraqi unit led by Lt. Col. James Rhodes, he's given a ride on enemy lines. That ride ends badly when Stark's Humvee that he's riding in is attacked by enemy combatants. He survives - barely - with a chest full of shrapnel and a car battery attached to his heart. In order to survive he comes up with a way to miniaturize the battery and figures out that the battery can power something else. Thus Iron Man is born. He uses the primitive device to escape from the cave in Iraq. Once back home, he then begins work on perfecting the Iron Man suit. But the man who was put in charge of Stark Industries has plans of his own to take over Tony's technology for other matters.",
    "Awards": "Nominated for 2 Oscars. Another 20 wins & 65 nominations.",
    "Poster": "https://ia.media-imdb.com/images/M/MV5BMTczNTI2ODUwOF5BMl5BanBnXkFtZTcwMTU0NTIzMw@@._V1_SX300.jpg"
  },
  {
    "Title": "The Lion King",
    "Year": "1994",
    "Runtime": "88 min",
    "Genre": "Animation, Adventure, Drama",
    "Plot": "A young lion Prince is cast out of his pride by his cruel uncle, who claims he killed his father. While the uncle rules with an iron paw, the prince grows up beyond the Savannah, living by a philosophy: No worries for the rest of your days. But when his past comes to haunt him, the young Prince must decide his fate: will he remain an outcast, or face his demons and become what he needs to be?",
    "Poster": "https://ia.media-imdb.com/images/M/MV5BYTYxNGMyZTYtMjE3MS00MzNjLWFjNmYtMDk3N2FmM2JiM2M1XkEyXkFqcGdeQXVyNjY5NDU4NzI@._V1_SX300.jpg"
  },
  {
    "Title": "Lord of War",
    "Year": "2005",
    "Runtime": "122 min",
    "Genre": "Crime, Drama, Thriller",
    "Plot": "This film charts the rise and fall of Yuri Orlov, from his early days in the early 1980s in Little Odessa, selling guns to mobsters in his local neighbourhood, through to his ascension through the decade of excess and indulgence into the early 90s, where he forms a business partnership with an African warlord and his psychotic son. The film also charts his relationship through the years with his younger brother, his marriage to a famous model, his relentless pursuit by a determined federal agent and his inner demons that sway between his drive for success and the immorality of what he does.",
    "Poster": "https://m.media-amazon.com/images/M/MV5BMTYzZWE3MDAtZjZkMi00MzhlLTlhZDUtNmI2Zjg3OWVlZWI0XkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_SX300.jpg"
  },
  {
    "Title": "The Blind Side",
    "Year": "2009",
    "Runtime": "129 min",
    "Genre": "Biography, Drama, Sport",
    "Plot": "Based on the true story of Leigh Anne Tuohy and Sean Tuohy who take in a homeless teenage African-American, Michael Oher. Michael has no idea who his father is and his mother is a drug addict. Michael has had little formal education and few skills to help him learn. Leigh Anne soon takes charge however, as is her nature, ensuring that the young man has every opportunity to succeed. When he expresses an interest in football, she goes all out to help him, including giving the coach a few ideas on how best to use Michael's skills. They not only provide him with a loving home, but hire a tutor to help him improve his grades to the point where he would qualify for an NCAA Division I athletic scholarship. Michael Oher was the first-round pick of the Baltimore Ravens in the 2009 NFL draft.",
    "Poster": "https://ia.media-imdb.com/images/M/MV5BMjEzOTE3ODM3OF5BMl5BanBnXkFtZTcwMzYyODI4Mg@@._V1_SX300.jpg"
  },
  {
    "Title": "The Rock",
    "Year": "1996",
    "Runtime": "136 min",
    "Genre": "Action, Adventure, Thriller",
    "Plot": "Stanley Goodspeed, who lives in Washington D.C., is a biochemist who works for the FBI. Soon after his fiancée Carla Pestalozzi announces that she is pregnant, Stanley gets a call from FBI director James Womack. Womack tells Stanley that San Francisco's Alcatraz Island has been taken hostage, along with 81 tourists, by marine General Francis Xavier Hummel who, for years, has been protesting the government's refusal to pay benefits to families of war veterans who died during covert military operations. The death of his wife Barbara Hummel on March 9, 1995 drove General Hummel over the edge, and now he's holding hostages in order to get his point across. Stanley is needed because General Hummel has stolen some VX gas warheads and has announced that he will launch them onto San Francisco unless his demands are met. Stanley knows how to disarm the bombs, but Stanley needs someone who knows Alcatraz well enough to get him inside. That man is former British intelligence agent John Patrick Mason, who has been in prison for the past 30 years without a trial because he was accused of stealing the private files of J. Edgar Hoover. In 1962, John became the only inmate ever to escape from Alcatraz, and he stayed out of Alcatraz long enough to father a daughter named Jade Angelou. Despite his extreme hatred of the FBI, John agrees to help Stanley. When John and Stanley are sent into Alcatraz with a Navy SEAL team, General Hummel's men kill the entire SEAL team, leaving Stanley and John to work on their own to rescue the hostages.",
    "Poster": "https://ia.media-imdb.com/images/M/MV5BZDJjOTE0N2EtMmRlZS00NzU0LWE0ZWQtM2Q3MWMxNjcwZjBhXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_SX300.jpg"
  },
  {
    "Title": "The Pianist",
    "Year": "2002",
    "Runtime": "150 min",
    "Genre": "Biography, Drama, Music",
    "Plot": "In this adaptation of the autobiography \"The Pianist: The Extraordinary True Story of One Man's Survival in Warsaw, 1939-1945,\" Wladyslaw Szpilman, a Polish Jewish radio station pianist, sees Warsaw change gradually as World War II begins. Szpilman is forced into the Warsaw Ghetto, but is later separated from his family during Operation Reinhard. From this time until the concentration camp prisoners are released, Szpilman hides in various locations among the ruins of Warsaw.",
    "Poster": "https://m.media-amazon.com/images/M/MV5BOWRiZDIxZjktMTA1NC00MDQ2LWEzMjUtMTliZmY3NjQ3ODJiXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SX300.jpg"
  }
]